tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "puma/puma"
tap "cloudflare/cloudflare"

brew "asdf"
brew "chezmoi" # dotfiles manager
brew "git"
brew "imagemagick"
brew "vips" # image processing
brew "postgresql@15", restart_service: true, link: true
brew "redis", restart_service: true
brew "heroku"
# brew "heroku/brew/heroku-node"
brew "puma/puma/puma-dev"
brew "cloudflare/cloudflare/cloudflared", link: true

cask "bluesnooze"
# https://github.com/actuallymentor/battery/
# cask "battery"
cask "ngrok"
# cask "unnaturalscrollwheels"
# cask "handbrake" # video converter
cask "warp" # terminal
cask "wkhtmltopdf"

# DevOps
brew "tfenv"
brew "awscli"
cask "session-manager-plugin"
# brew "aws-sam-cli"
# brew "cfn-lint"
# brew "cloudformation-guard"


# asdf nodejs
brew "gpg"
brew "gawk"

# asdf ruby
brew "ruby-build"
brew "openssl@1.1"
brew "openssl@3"
brew "readline"
