tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "aws/tap"

brew 'chezmoi'
brew "bash"
brew "zsh"
brew "wget"
brew "curl"
brew "asdf"
brew "git"
brew "imagemagick"
brew "postgresql@13", restart_service: true
brew "redis", restart_service: true
brew "heroku"
brew "heroku/brew/heroku-node"
brew "puma/puma/puma-dev"
brew "tfenv"


cask "chromedriver"
cask "google-drive"
cask "bluesnooze"
cask "iterm2"
cask "ngrok"
cask "unnaturalscrollwheels"
# cask "wkhtmltopdf"

# AWS
brew "awscli"
brew "aws-sam-cli"
# brew "cfn-lint"
# brew "cloudformation-guard"


# asdf nodejs
brew "gpg"
brew "gawk"

# asdf ruby
brew "ruby-build"
brew "openssl@1.1"
brew "readline"
